RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the Fan API.
//
//*****************************************************************************
#ifdef ROM_FanIntClear
#define MAP_FanIntClear \
        ROM_FanIntClear
#else
#define MAP_FanIntClear \
        FanIntClear
#endif
#ifdef ROM_FanChannelConfigAuto
#define MAP_FanChannelConfigAuto \
        ROM_FanChannelConfigAuto
#else
#define MAP_FanChannelConfigAuto \
        FanChannelConfigAuto
#endif
#ifdef ROM_FanChannelConfigManual
#define MAP_FanChannelConfigManual \
        ROM_FanChannelConfigManual
#else
#define MAP_FanChannelConfigManual \
        FanChannelConfigManual
#endif
#ifdef ROM_FanChannelDisable
#define MAP_FanChannelDisable \
        ROM_FanChannelDisable
#else
#define MAP_FanChannelDisable \
        FanChannelDisable
#endif
#ifdef ROM_FanChannelDutyGet
#define MAP_FanChannelDutyGet \
        ROM_FanChannelDutyGet
#else
#define MAP_FanChannelDutyGet \
        FanChannelDutyGet
#endif
#ifdef ROM_FanChannelDutySet
#define MAP_FanChannelDutySet \
        ROM_FanChannelDutySet
#else
#define MAP_FanChannelDutySet \
        FanChannelDutySet
#endif
#ifdef ROM_FanChannelEnable
#define MAP_FanChannelEnable \
        ROM_FanChannelEnable
#else
#define MAP_FanChannelEnable \
        FanChannelEnable
#endif
#ifdef ROM_FanChannelRPMGet
#define MAP_FanChannelRPMGet \
        ROM_FanChannelRPMGet
#else
#define MAP_FanChannelRPMGet \
        FanChannelRPMGet
#endif
#ifdef ROM_FanChannelRPMSet
#define MAP_FanChannelRPMSet \
        ROM_FanChannelRPMSet
#else
#define MAP_FanChannelRPMSet \
        FanChannelRPMSet
#endif
#ifdef ROM_FanChannelStatus
#define MAP_FanChannelStatus \
        ROM_FanChannelStatus
#else
#define MAP_FanChannelStatus \
        FanChannelStatus
#endif
#ifdef ROM_FanChannelsGet
#define MAP_FanChannelsGet \
        ROM_FanChannelsGet
#else
#define MAP_FanChannelsGet \
        FanChannelsGet
#endif
#ifdef ROM_FanIntDisable
#define MAP_FanIntDisable \
        ROM_FanIntDisable
#else
#define MAP_FanIntDisable \
        FanIntDisable
#endif
#ifdef ROM_FanIntEnable
#define MAP_FanIntEnable \
        ROM_FanIntEnable
#else
#define MAP_FanIntEnable \
        FanIntEnable
#endif
#ifdef ROM_FanIntStatus
#define MAP_FanIntStatus \
        ROM_FanIntStatus
#else
#define MAP_FanIntStatus \
        FanIntStatus
#endif

//*****************************************************************************
//
// Macros for the Flash API.
//
//*****************************************************************************
#ifdef ROM_FlashProgram
#define MAP_FlashProgram \
        ROM_FlashProgram
#else
#define MAP_FlashProgram \
        FlashProgram
#endif
#ifdef ROM_FlashUsecGet
#define MAP_FlashUsecGet \
        ROM_FlashUsecGet
#else
#define MAP_FlashUsecGet \
        FlashUsecGet
#endif
#ifdef ROM_FlashUsecSet
#define MAP_FlashUsecSet \
        ROM_FlashUsecSet
#else
#define MAP_FlashUsecSet \
        FlashUsecSet
#endif
#ifdef ROM_FlashErase
#define MAP_FlashErase \
        ROM_FlashErase
#else
#define MAP_FlashErase \
        FlashErase
#endif
#ifdef ROM_FlashProtectGet
#define MAP_FlashProtectGet \
        ROM_FlashProtectGet
#else
#define MAP_FlashProtectGet \
        FlashProtectGet
#endif
#ifdef ROM_FlashProtectSet
#define MAP_FlashProtectSet \
        ROM_FlashProtectSet
#else
#define MAP_FlashProtectSet \
        FlashProtectSet
#endif
#ifdef ROM_FlashProtectSave
#define MAP_FlashProtectSave \
        ROM_FlashProtectSave
#else
#define MAP_FlashProtectSave \
        FlashProtectSave
#endif
#ifdef ROM_FlashUserGet
#define MAP_FlashUserGet \
        ROM_FlashUserGet
#else
#define MAP_FlashUserGet \
        FlashUserGet
#endif
#ifdef ROM_FlashUserSet
#define MAP_FlashUserSet \
        ROM_FlashUserSet
#else
#define MAP_FlashUserSet \
        FlashUserSet
#endif
#ifdef ROM_FlashUserSave
#define MAP_FlashUserSave \
        ROM_FlashUserSave
#else
#define MAP_FlashUserSave \
        FlashUserSave
#endif
#ifdef ROM_FlashIntEnable
#define MAP_FlashIntEnable \
        ROM_FlashIntEnable
#else
#define MAP_FlashIntEnable \
        FlashIntEnable
#endif
#ifdef ROM_FlashIntDisable
#define MAP_FlashIntDisable \
        ROM_FlashIntDisable
#else
#define MAP_FlashIntDisable \
        FlashIntDisable
#endif
#ifdef ROM_FlashIntStatus
#define MAP_FlashIntStatus \
        ROM_FlashIntStatus
#else
#define MAP_FlashIntStatus \
        FlashIntStatus
#endif
#ifdef ROM_FlashIntClear
#define MAP_FlashIntClear \
        ROM_FlashIntClear
#else
#define MAP_FlashIntClear \
        FlashIntClear
#endif

//*****************************************************************************
//
// Macros for the FPU API.
//
//*****************************************************************************
#ifdef ROM_FPUEnable
#define MAP_FPUEnable \
        ROM_FPUEnable
#else
#define MAP_FPUEnable \
        FPUEnable
#endif
#ifdef ROM_FPUDisable
#define MAP_FPUDisable \
        ROM_FPUDisable
#else
#define MAP_FPUDisable \
        FPUDisable
#endif
#ifdef ROM_FPUFlushToZeroModeSet
#define MAP_FPUFlushToZeroModeSet \
        ROM_FPUFlushToZeroModeSet
#else
#define MAP_FPUFlushToZeroModeSet \
        FPUFlushToZeroModeSet
#endif
#ifdef ROM_FPUHalfPrecisionModeSet
#define MAP_FPUHalfPrecisionModeSet \
        ROM_FPUHalfPrecisionModeSet
#else
#define MAP_FPUHalfPrecisionModeSet \
        FPUHalfPrecisionModeSet
#endif
#ifdef ROM_FPULazyStackingEnable
#define MAP_FPULazyStackingEnable \
        ROM_FPULazyStackingEnable
#else
#define MAP_FPULazyStackingEnable \
        FPULazyStackingEnable
#endif
#ifdef ROM_FPUNaNModeSet
#define MAP_FPUNaNModeSet \
        ROM_FPUNaNModeSet
#else
#define MAP_FPUNaNModeSet \
        FPUNaNModeSet
#endif
#ifdef ROM_FPURoundingModeSet
#define MAP_FPURoundingModeSet \
        ROM_FPURoundingModeSet
#else
#define MAP_FPURoundingModeSet \
        FPURoundingModeSet
#endif
#ifdef ROM_FPUStackingDisable
#define MAP_FPUStackingDisable \
        ROM_FPUStackingDisable
#else
#define MAP_FPUStackingDisable \
        FPUStackingDisable
#endif
#ifdef ROM_FPUStackingEnable
#define MAP_FPUStackingEnable \
        ROM_FPUStackingEnable
#else
#define MAP_FPUStackingEnable \
        FPUStackingEnable
#endif

//*****************************************************************************
//
// Macros for the GPIO API.
//
//*****************************************************************************
#ifdef ROM_GPIOPinWrite
#define MAP_GPIOPinWrite \
        ROM_GPIOPinWrite
#else
#define MAP_GPIOPinWrite \
        GPIOPinWrite
#endif
#ifdef ROM_GPIODirModeSet
#define MAP_GPIODirModeSet \
        ROM_GPIODirModeSet
#else
#define MAP_GPIODirModeSet \
        GPIODirModeSet
#endif
#ifdef ROM_GPIODirModeGet
#define MAP_GPIODirModeGet \
        ROM_GPIODirModeGet
#else
#define MAP_GPIODirModeGet \
        GPIODirModeGet
#endif
#ifdef ROM_GPIOIntTypeSet
#define MAP_GPIOIntTypeSet \
        ROM_GPIOIntTypeSet
#else
#define MAP_GPIOIntTypeSet \
        GPIOIntTypeSet
#endif
#ifdef ROM_GPIOIntTypeGet
#define MAP_GPIOIntTypeGet \
        ROM_GPIOIntTypeGet
#else
#define MAP_GPIOIntTypeGet \
        GPIOIntTypeGet
#endif
#ifdef ROM_GPIOPadConfigSet
#define MAP_GPIOPadConfigSet \
        ROM_GPIOPadConfigSet
#else
#define MAP_GPIOPadConfigSet \
        GPIOPadConfigSet
#endif
#ifdef ROM_GPIOPadConfigGet
#define MAP_GPIOPadConfigGet \
        ROM_GPIOPadConfigGet
#else
#define MAP_GPIOPadConfigGet \
        GPIOPadConfigGet
#endif
#ifdef ROM_GPIOPinIntEnable
#define MAP_GPIOPinIntEnable \
        ROM_GPIOPinIntEnable
#else
#define MAP_GPIOPinIntEnable \
        GPIOPinIntEnable
#endif
#ifdef ROM_GPIOPinIntDisable
#define MAP_GPIOPinIntDisable \
        ROM_GPIOPinIntDisable
#else
#define MAP_GPIOPinIntDisable \
        GPIOPinIntDisable
#endif
#ifdef ROM_GPIOPinIntStatus
#define MAP_GPIOPinIntStatus \
        ROM_GPIOPinIntStatus
#else
#define MAP_GPIOPinIntStatus \
        GPIOPinIntStatus
#endif
#ifdef ROM_GPIOPinIntClear
#define MAP_GPIOPinIntClear \
        ROM_GPIOPinIntClear
#else
#define MAP_GPIOPinIntClear \
        GPIOPinIntClear
#endif
#ifdef ROM_GPIOPinRead
#define MAP_GPIOPinRead \
        ROM_GPIOPinRead
#else
#define MAP_GPIOPinRead \
        GPIOPinRead
#endif
#ifdef ROM_GPIOPinTypeCAN
#define MAP_GPIOPinTypeCAN \
        ROM_GPIOPinTypeCAN
#else
#define MAP_GPIOPinTypeCAN \
        GPIOPinTypeCAN
#endif
#ifdef ROM_GPIOPinTypeComparator
#define MAP_GPIOPinTypeComparator \
        ROM_GPIOPinTypeComparator
#else
#define MAP_GPIOPinTypeComparator \
        GPIOPinTypeComparator
#endif
#ifdef ROM_GPIOPinTypeGPIOInput
#define MAP_GPIOPinTypeGPIOInput \
        ROM_GPIOPinTypeGPIOInput
#else
#define MAP_GPIOPinTypeGPIOInput \
        GPIOPinTypeGPIOInput
#endif
#ifdef ROM_GPIOPinTypeGPIOOutput
#define MAP_GPIOPinTypeGPIOOutput \
        ROM_GPIOPinTypeGPIOOutput
#else
#define MAP_GPIOPinTypeGPIOOutput \
        GPIOPinTypeGPIOOutput
#endif
#ifdef ROM_GPIOPinTypeI2C
#define MAP_GPIOPinTypeI2C \
        ROM_GPIOPinTypeI2C
#else
#define MAP_GPIOPinTypeI2C \
        GPIOPinTypeI2C
#endif
#ifdef ROM_GPIOPinTypePWM
#define MAP_GPIOPinTypePWM \
        ROM_GPIOPinTypePWM
#else
#define MAP_GPIOPinTypePWM \
        GPIOPinTypePWM
#endif
#ifdef ROM_GPIOPinTypeQEI
#define MAP_GPIOPinTypeQEI \
        ROM_GPIOPinTypeQEI
#else
#define MAP_GPIOPinTypeQEI \
        GPIOPinTypeQEI
#endif
#ifdef ROM_GPIOPinTypeSSI
#define MAP_GPIOPinTypeSSI \
        ROM_GPIOPinTypeSSI
#else
#define MAP_GPIOPinTypeSSI \
        GPIOPinTypeSSI
#endif
#ifdef ROM_GPIOPinTypeTimer
#define MAP_GPIOPinTypeTimer \
        ROM_GPIOPinTypeTimer
#else
#define MAP_GPIOPinTypeTimer \
        GPIOPinTypeTimer
#endif
#ifdef ROM_GPIOPinTypeUART
#define MAP_GPIOPinTypeUART \
        ROM_GPIOPinTypeUART
#else
#define MAP_GPIOPinTypeUART \
        GPIOPinTypeUART
#endif
#ifdef ROM_GPIOPinTypeGPIOOutputOD
#define MAP_GPIOPinTypeGPIOOutputOD \
        ROM_GPIOPinTypeGPIOOutputOD
#else
#define MAP_GPIOPinTypeGPIOOutputOD \
        GPIOPinTypeGPIOOutputOD
#endif
#ifdef ROM_GPIOPinTypeADC
#define MAP_GPIOPinTypeADC \
        ROM_GPIOPinTypeADC
#else
#define MAP_GPIOPinTypeADC \
        GPIOPinTypeADC
#endif
#ifdef ROM_GPIOPinTypeUSBDigital
#define MAP_GPIOPinTypeUSBDigital \
        ROM_GPIOPinTypeUSBDigital
#else
#define MAP_GPIOPinTypeUSBDigital \
        GPIOPinTypeUSBDigital
#endif
#ifdef ROM_GPIOPinTypeI2S
#define MAP_GPIOPinTypeI2S \
        ROM_GPIOPinTypeI2S
#else
#define MAP_GPIOPinTypeI2S \
        GPIOPinTypeI2S
#endif
#ifdef ROM_GPIOPinConfigure
#define MAP_GPIOPinConfigure \
        ROM_GPIOPinConfigure
#else
#define MAP_GPIOPinConfigure \
        GPIOPinConfigure
#endif
#ifdef ROM_GPIOPinTypeEthernetLED
#define MAP_GPIOPinTypeEthernetLED \
        ROM_GPIOPinTypeEthernetLED
#else
#define MAP_GPIOPinTypeEthernetLED \
        GPIOPinTypeEthernetLED
#endif
#ifdef ROM_GPIOPinTypeUSBAnalog
#define MAP_GPIOPinTypeUSBAnalog \
        ROM_GPIOPinTypeUSBAnalog
#else
#define MAP_GPIOPinTypeUSBAnalog \
        GPIOPinTypeUSBAnalog
#endif
#ifdef ROM_GPIOPinTypeEPI
#define MAP_GPIOPinTypeEPI \
        ROM_GPIOPinTypeEPI
#else
#define MAP_GPIOPinTypeEPI \
        GPIOPinTypeEPI
#endif
#ifdef ROM_GPIOPinTypeEthernetMII
#define MAP_GPIOPinTypeEthernetMII \
        ROM_GPIOPinTypeEthernetMII
#else
#define MAP_GPIOPinTypeEthernetMII \
        GPIOPinTypeEthernetMII
#endif
#ifdef ROM_GPIODMATriggerEnable
#define MAP_GPIODMATriggerEnable \
        ROM_GPIODMATriggerEnable
#else
#define MAP_GPIODMATriggerEnable \
        GPIODMATriggerEnable
#endif
#ifdef ROM_GPIODMATriggerDisable
#define MAP_GPIODMATriggerDisable \
        ROM_GPIODMATriggerDisable
#else
#define MAP_GPIODMATriggerDisable \
        GPIODMATriggerDisable
#endif
#ifdef ROM_GPIOADCTriggerEnable
#define MAP_GPIOADCTriggerEnable \
        ROM_GPIOADCTriggerEnable
#else
#define MAP_GPIOADCTriggerEnable \
        GPIOADCTriggerEnable
#endif
#ifdef ROM_GPIOADCTriggerDisable
#define MAP_GPIOADCTriggerDisable \
        ROM_GPIOADCTriggerDisable
#else
#define MAP_GPIOADCTriggerDisable \
        GPIOADCTriggerDisable
#endif
#ifdef ROM_GPIOPinTypeFan
#define MAP_GPIOPinTypeFan \
        ROM_GPIOPinTypeFan
#else
#define MAP_GPIOPinTypeFan \
        GPIOPinTypeFan
#endif
#ifdef ROM_GPIOPinTypeLPC
#define MAP_GPIOPinTypeLPC \
        ROM_GPIOPinTypeLPC
#else
#define MAP_GPIOPinTypeLPC \
        GPIOPinTypeLPC
#endif
#ifdef ROM_GPIOPinTypePECIRx
#define MAP_GPIOPinTypePECIRx \
        ROM_GPIOPinTypePECIRx
#else
#define MAP_GPIOPinTypePECIRx \
        GPIOPinTypePECIRx
#endif
#ifdef ROM_GPIOPinTypePECITx
#define MAP_GPIOPinTypePECITx \
        ROM_GPIOPinTypePECITx
#else
#define MAP_GPIOPinTypePECITx \
        GPIOPinTypePECITx
#endif
#ifdef ROM_GPIOPinTypeI2CSCL
#define MAP_GPIOPinTypeI2CSCL \
        ROM_GPIOPinTypeI2CSCL
#else
#define MAP_GPIOPinTypeI2CSCL \
        GPIOPinTypeI2CSCL
#endif

//*****************************************************************************
//
// Macros for the Hibernate API.
//
//*****************************************************************************
#ifdef ROM_HibernateIntClear
#define MAP_HibernateIntClear \
        ROM_HibernateIntClear
#else
#define MAP_HibernateIntClear \
        HibernateIntClear
#endif
#ifdef ROM_HibernateEnableExpClk
#define MAP_HibernateEnableExpClk \
        ROM_HibernateEnableExpClk
#else
#define MAP_HibernateEnableExpClk \
        HibernateEnableExpClk
#endif
#ifdef ROM_HibernateDisable
#define MAP_HibernateDisable \
        ROM_HibernateDisable
#else
#define MAP_HibernateDisable \
        HibernateDisable
#endif
#ifdef ROM_HibernateClockSelect
#define MAP_HibernateClockSelect \
        ROM_HibernateClockSelect
#else
#define MAP_HibernateClockSelect \
        HibernateClockSelect
#endif
#ifdef ROM_HibernateRTCEnable
#define MAP_HibernateRTCEnable \
        ROM_HibernateRTCEnable
#else
#define MAP_HibernateRTCEnable \
        HibernateRTCEnable
#endif
#ifdef ROM_HibernateRTCDisable
#define MAP_HibernateRTCDisable \
        ROM_HibernateRTCDisable
#else
#define MAP_HibernateRTCDisable \
        HibernateRTCDisable
#endif
#ifdef ROM_HibernateWakeSet
#define MAP_HibernateWakeSet \
        ROM_HibernateWakeSet
#else
#define MAP_HibernateWakeSet \
        HibernateWakeSet
#endif
#ifdef ROM_HibernateWakeGet
#define MAP_HibernateWakeGet \
        ROM_HibernateWakeGet
#else
#define MAP_HibernateWakeGet \
        HibernateWakeGet
#endif
#ifdef ROM_HibernateLowBatSet
#define MAP_HibernateLowBatSet \
        ROM_HibernateLowBatSet
#else
#define MAP_HibernateLowBatSet \
        HibernateLowBatSet
#endif
#ifdef ROM_HibernateLowBatGet
#define MAP_HibernateLowBatGet \
        ROM_HibernateLowBatGet
#else
#define MAP_HibernateLowBatGet \
        HibernateLowBatGet
#endif
#ifdef ROM_HibernateRTCSet
#define MAP_HibernateRTCSet \
        ROM_HibernateRTCSet
#else
#define MAP_HibernateRTCSet \
        HibernateRTCSet
#endif
#ifdef ROM_HibernateRTCGet
#define MAP_HibernateRTCGet \
        ROM_HibernateRTCGet
#else
#define MAP_HibernateRTCGet \
        HibernateRTCGet
#endif
#ifdef ROM_HibernateRTCMatch0Set
#define MAP_HibernateRTCMatch0Set \
        ROM_HibernateRTCMatch0Set
#else
#define MAP_HibernateRTCMatch0Set \
        HibernateRTCMatch0Set
#endif
#ifdef ROM_HibernateRTCMatch0Get
#define MAP_HibernateRTCMatch0Get \
        ROM_HibernateRTCMatch0Get
#else
#define MAP_HibernateRTCMatch0Get \
        HibernateRTCMatch0Get
#endif
#ifdef ROM_HibernateRTCMatch1Set
#define MAP_HibernateRTCMatch1Set \
        ROM_HibernateRTCMatch1Set
#else
#define MAP_HibernateRTCMatch1Set \
        HibernateRTCMatch1Set
#endif
#ifdef ROM_HibernateRTCMatch1Get
#define MAP_HibernateRTCMatch1Get \
        ROM_HibernateRTCMatch1Get
#else
#define MAP_HibernateRTCMatch1Get \
        HibernateRTCMatch1Get
#endif
#ifdef ROM_HibernateRTCTrimSet
#define MAP_HibernateRTCTrimSet \
        ROM_HibernateRTCTrimSet
#else
#define MAP_HibernateRTCTrimSet \
        HibernateRTCTrimSet
#endif
#ifdef ROM_HibernateRTCTrimGet
#define MAP_HibernateRTCTrimGet \
        ROM_HibernateRTCTrimGet
#else
#define MAP_HibernateRTCTrimGet \
        HibernateRTCTrimGet
#endif
#ifdef ROM_HibernateDataSet
#define MAP_HibernateDataSet \
        ROM_HibernateDataSet
#else
#define MAP_HibernateDataSet \
        HibernateDataSet
#endif
#ifdef ROM_HibernateDataGet
#define MAP_HibernateDataGet \
        ROM_HibernateDataGet
#else
#define MAP_HibernateDataGet \
        HibernateDataGet
#endif
#ifdef ROM_HibernateRequest
#define MAP_HibernateRequest \
        ROM_HibernateRequest
#else
#define MAP_HibernateRequest \
        HibernateRequest
#endif
#ifdef ROM_HibernateIntEnable
#define MAP_HibernateIntEnable \
        ROM_HibernateIntEnable
#else
#define MAP_HibernateIntEnable \
        HibernateIntEnable
#endif
#ifdef ROM_HibernateIntDisable
#define MAP_HibernateIntDisable \
        ROM_HibernateIntDisable
#else
#define MAP_HibernateIntDisable \
        HibernateIntDisable
#endif
#ifdef ROM_HibernateIntStatus
#define MAP_HibernateIntStatus \
        ROM_HibernateIntStatus
#else
#define MAP_HibernateIntStatus \
        HibernateIntStatus
#endif
#ifdef ROM_HibernateIsActive
#define MAP_HibernateIsActive \
        ROM_HibernateIsActive
#else
#define MAP_HibernateIsActive \
        HibernateIsActive
#endif
#ifdef ROM_HibernateRTCSSMatch0Set
#define MAP_HibernateRTCSSMatch0Set \
        ROM_HibernateRTCSSMatch0Set
#else
#define MAP_HibernateRTCSSMatch0Set \
        HibernateRTCSSMatch0Set
#endif
#ifdef ROM_HibernateRTCSSMatch0Get
#define MAP_HibernateRTCSSMatch0Get \
        ROM_HibernateRTCSSMatch0Get
#else
#define MAP_HibernateRTCSSMatch0Get \
        HibernateRTCSSMatch0Get
#endif
#ifdef ROM_HibernateRTCSSGet
#define MAP_HibernateRTCSSGet \
        ROM_HibernateRTCSSGet
#else
#define MAP_HibernateRTCSSGet \
        HibernateRTCSSGet
#endif
#ifdef ROM_HibernateClockConfig
#define MAP_HibernateClockConfig \
        ROM_HibernateClockConfig
#else
#define MAP_HibernateClockConfig \
        HibernateClockConfig
#endif
#ifdef ROM_HibernateBatCheckStart
#define MAP_HibernateBatCheckStart \
        ROM_HibernateBatCheckStart
#else
#define MAP_HibernateBatCheckStart \
        HibernateBatCheckStart
#endif
#ifdef ROM_HibernateBatCheckDone
#define MAP_HibernateBatCheckDone \
        ROM_HibernateBatCheckDone
#else
#define MAP_HibernateBatCheckDone \
        HibernateBatCheckDone
#endif

