RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the I2C API.
//
//*****************************************************************************
#ifdef ROM_I2CMasterDataPut
#define MAP_I2CMasterDataPut \
        ROM_I2CMasterDataPut
#else
#define MAP_I2CMasterDataPut \
        I2CMasterDataPut
#endif
#ifdef ROM_I2CMasterInitExpClk
#define MAP_I2CMasterInitExpClk \
        ROM_I2CMasterInitExpClk
#else
#define MAP_I2CMasterInitExpClk \
        I2CMasterInitExpClk
#endif
#ifdef ROM_I2CSlaveInit
#define MAP_I2CSlaveInit \
        ROM_I2CSlaveInit
#else
#define MAP_I2CSlaveInit \
        I2CSlaveInit
#endif
#ifdef ROM_I2CMasterEnable
#define MAP_I2CMasterEnable \
        ROM_I2CMasterEnable
#else
#define MAP_I2CMasterEnable \
        I2CMasterEnable
#endif
#ifdef ROM_I2CSlaveEnable
#define MAP_I2CSlaveEnable \
        ROM_I2CSlaveEnable
#else
#define MAP_I2CSlaveEnable \
        I2CSlaveEnable
#endif
#ifdef ROM_I2CMasterDisable
#define MAP_I2CMasterDisable \
        ROM_I2CMasterDisable
#else
#define MAP_I2CMasterDisable \
        I2CMasterDisable
#endif
#ifdef ROM_I2CSlaveDisable
#define MAP_I2CSlaveDisable \
        ROM_I2CSlaveDisable
#else
#define MAP_I2CSlaveDisable \
        I2CSlaveDisable
#endif
#ifdef ROM_I2CMasterIntEnable
#define MAP_I2CMasterIntEnable \
        ROM_I2CMasterIntEnable
#else
#define MAP_I2CMasterIntEnable \
        I2CMasterIntEnable
#endif
#ifdef ROM_I2CSlaveIntEnable
#define MAP_I2CSlaveIntEnable \
        ROM_I2CSlaveIntEnable
#else
#define MAP_I2CSlaveIntEnable \
        I2CSlaveIntEnable
#endif
#ifdef ROM_I2CMasterIntDisable
#define MAP_I2CMasterIntDisable \
        ROM_I2CMasterIntDisable
#else
#define MAP_I2CMasterIntDisable \
        I2CMasterIntDisable
#endif
#ifdef ROM_I2CSlaveIntDisable
#define MAP_I2CSlaveIntDisable \
        ROM_I2CSlaveIntDisable
#else
#define MAP_I2CSlaveIntDisable \
        I2CSlaveIntDisable
#endif
#ifdef ROM_I2CMasterIntStatus
#define MAP_I2CMasterIntStatus \
        ROM_I2CMasterIntStatus
#else
#define MAP_I2CMasterIntStatus \
        I2CMasterIntStatus
#endif
#ifdef ROM_I2CSlaveIntStatus
#define MAP_I2CSlaveIntStatus \
        ROM_I2CSlaveIntStatus
#else
#define MAP_I2CSlaveIntStatus \
        I2CSlaveIntStatus
#endif
#ifdef ROM_I2CMasterIntClear
#define MAP_I2CMasterIntClear \
        ROM_I2CMasterIntClear
#else
#define MAP_I2CMasterIntClear \
        I2CMasterIntClear
#endif
#ifdef ROM_I2CSlaveIntClear
#define MAP_I2CSlaveIntClear \
        ROM_I2CSlaveIntClear
#else
#define MAP_I2CSlaveIntClear \
        I2CSlaveIntClear
#endif
#ifdef ROM_I2CMasterSlaveAddrSet
#define MAP_I2CMasterSlaveAddrSet \
        ROM_I2CMasterSlaveAddrSet
#else
#define MAP_I2CMasterSlaveAddrSet \
        I2CMasterSlaveAddrSet
#endif
#ifdef ROM_I2CMasterBusy
#define MAP_I2CMasterBusy \
        ROM_I2CMasterBusy
#else
#define MAP_I2CMasterBusy \
        I2CMasterBusy
#endif
#ifdef ROM_I2CMasterBusBusy
#define MAP_I2CMasterBusBusy \
        ROM_I2CMasterBusBusy
#else
#define MAP_I2CMasterBusBusy \
        I2CMasterBusBusy
#endif
#ifdef ROM_I2CMasterControl
#define MAP_I2CMasterControl \
        ROM_I2CMasterControl
#else
#define MAP_I2CMasterControl \
        I2CMasterControl
#endif
#ifdef ROM_I2CMasterErr
#define MAP_I2CMasterErr \
        ROM_I2CMasterErr
#else
#define MAP_I2CMasterErr \
        I2CMasterErr
#endif
#ifdef ROM_I2CMasterDataGet
#define MAP_I2CMasterDataGet \
        ROM_I2CMasterDataGet
#else
#define MAP_I2CMasterDataGet \
        I2CMasterDataGet
#endif
#ifdef ROM_I2CSlaveStatus
#define MAP_I2CSlaveStatus \
        ROM_I2CSlaveStatus
#else
#define MAP_I2CSlaveStatus \
        I2CSlaveStatus
#endif
#ifdef ROM_I2CSlaveDataPut
#define MAP_I2CSlaveDataPut \
        ROM_I2CSlaveDataPut
#else
#define MAP_I2CSlaveDataPut \
        I2CSlaveDataPut
#endif
#ifdef ROM_I2CSlaveDataGet
#define MAP_I2CSlaveDataGet \
        ROM_I2CSlaveDataGet
#else
#define MAP_I2CSlaveDataGet \
        I2CSlaveDataGet
#endif
#ifdef ROM_I2CSlaveIntEnableEx
#define MAP_I2CSlaveIntEnableEx \
        ROM_I2CSlaveIntEnableEx
#else
#define MAP_I2CSlaveIntEnableEx \
        I2CSlaveIntEnableEx
#endif
#ifdef ROM_I2CSlaveIntDisableEx
#define MAP_I2CSlaveIntDisableEx \
        ROM_I2CSlaveIntDisableEx
#else
#define MAP_I2CSlaveIntDisableEx \
        I2CSlaveIntDisableEx
#endif
#ifdef ROM_I2CSlaveIntStatusEx
#define MAP_I2CSlaveIntStatusEx \
        ROM_I2CSlaveIntStatusEx
#else
#define MAP_I2CSlaveIntStatusEx \
        I2CSlaveIntStatusEx
#endif
#ifdef ROM_I2CSlaveIntClearEx
#define MAP_I2CSlaveIntClearEx \
        ROM_I2CSlaveIntClearEx
#else
#define MAP_I2CSlaveIntClearEx \
        I2CSlaveIntClearEx
#endif
#ifdef ROM_I2CMasterIntEnableEx
#define MAP_I2CMasterIntEnableEx \
        ROM_I2CMasterIntEnableEx
#else
#define MAP_I2CMasterIntEnableEx \
        I2CMasterIntEnableEx
#endif
#ifdef ROM_I2CMasterIntDisableEx
#define MAP_I2CMasterIntDisableEx \
        ROM_I2CMasterIntDisableEx
#else
#define MAP_I2CMasterIntDisableEx \
        I2CMasterIntDisableEx
#endif
#ifdef ROM_I2CMasterIntStatusEx
#define MAP_I2CMasterIntStatusEx \
        ROM_I2CMasterIntStatusEx
#else
#define MAP_I2CMasterIntStatusEx \
        I2CMasterIntStatusEx
#endif
#ifdef ROM_I2CMasterIntClearEx
#define MAP_I2CMasterIntClearEx \
        ROM_I2CMasterIntClearEx
#else
#define MAP_I2CMasterIntClearEx \
        I2CMasterIntClearEx
#endif
#ifdef ROM_I2CMasterTimeoutSet
#define MAP_I2CMasterTimeoutSet \
        ROM_I2CMasterTimeoutSet
#else
#define MAP_I2CMasterTimeoutSet \
        I2CMasterTimeoutSet
#endif
#ifdef ROM_I2CSlaveACKOverride
#define MAP_I2CSlaveACKOverride \
        ROM_I2CSlaveACKOverride
#else
#define MAP_I2CSlaveACKOverride \
        I2CSlaveACKOverride
#endif
#ifdef ROM_I2CSlaveACKValueSet
#define MAP_I2CSlaveACKValueSet \
        ROM_I2CSlaveACKValueSet
#else
#define MAP_I2CSlaveACKValueSet \
        I2CSlaveACKValueSet
#endif
#ifdef ROM_I2CSlaveAddressSet
#define MAP_I2CSlaveAddressSet \
        ROM_I2CSlaveAddressSet
#else
#define MAP_I2CSlaveAddressSet \
        I2CSlaveAddressSet
#endif
#ifdef ROM_I2CMasterLineStateGet
#define MAP_I2CMasterLineStateGet \
        ROM_I2CMasterLineStateGet
#else
#define MAP_I2CMasterLineStateGet \
        I2CMasterLineStateGet
#endif

//*****************************************************************************
//
// Macros for the I2S API.
//
//*****************************************************************************
#ifdef ROM_I2SIntStatus
#define MAP_I2SIntStatus \
        ROM_I2SIntStatus
#else
#define MAP_I2SIntStatus \
        I2SIntStatus
#endif
#ifdef ROM_I2STxEnable
#define MAP_I2STxEnable \
        ROM_I2STxEnable
#else
#define MAP_I2STxEnable \
        I2STxEnable
#endif
#ifdef ROM_I2STxDisable
#define MAP_I2STxDisable \
        ROM_I2STxDisable
#else
#define MAP_I2STxDisable \
        I2STxDisable
#endif
#ifdef ROM_I2STxDataPut
#define MAP_I2STxDataPut \
        ROM_I2STxDataPut
#else
#define MAP_I2STxDataPut \
        I2STxDataPut
#endif
#ifdef ROM_I2STxDataPutNonBlocking
#define MAP_I2STxDataPutNonBlocking \
        ROM_I2STxDataPutNonBlocking
#else
#define MAP_I2STxDataPutNonBlocking \
        I2STxDataPutNonBlocking
#endif
#ifdef ROM_I2STxConfigSet
#define MAP_I2STxConfigSet \
        ROM_I2STxConfigSet
#else
#define MAP_I2STxConfigSet \
        I2STxConfigSet
#endif
#ifdef ROM_I2STxFIFOLimitSet
#define MAP_I2STxFIFOLimitSet \
        ROM_I2STxFIFOLimitSet
#else
#define MAP_I2STxFIFOLimitSet \
        I2STxFIFOLimitSet
#endif
#ifdef ROM_I2STxFIFOLimitGet
#define MAP_I2STxFIFOLimitGet \
        ROM_I2STxFIFOLimitGet
#else
#define MAP_I2STxFIFOLimitGet \
        I2STxFIFOLimitGet
#endif
#ifdef ROM_I2STxFIFOLevelGet
#define MAP_I2STxFIFOLevelGet \
        ROM_I2STxFIFOLevelGet
#else
#define MAP_I2STxFIFOLevelGet \
        I2STxFIFOLevelGet
#endif
#ifdef ROM_I2SRxEnable
#define MAP_I2SRxEnable \
        ROM_I2SRxEnable
#else
#define MAP_I2SRxEnable \
        I2SRxEnable
#endif
#ifdef ROM_I2SRxDisable
#define MAP_I2SRxDisable \
        ROM_I2SRxDisable
#else
#define MAP_I2SRxDisable \
        I2SRxDisable
#endif
#ifdef ROM_I2SRxDataGet
#define MAP_I2SRxDataGet \
        ROM_I2SRxDataGet
#else
#define MAP_I2SRxDataGet \
        I2SRxDataGet
#endif
#ifdef ROM_I2SRxDataGetNonBlocking
#define MAP_I2SRxDataGetNonBlocking \
        ROM_I2SRxDataGetNonBlocking
#else
#define MAP_I2SRxDataGetNonBlocking \
        I2SRxDataGetNonBlocking
#endif
#ifdef ROM_I2SRxConfigSet
#define MAP_I2SRxConfigSet \
        ROM_I2SRxConfigSet
#else
#define MAP_I2SRxConfigSet \
        I2SRxConfigSet
#endif
#ifdef ROM_I2SRxFIFOLimitSet
#define MAP_I2SRxFIFOLimitSet \
        ROM_I2SRxFIFOLimitSet
#else
#define MAP_I2SRxFIFOLimitSet \
        I2SRxFIFOLimitSet
#endif
#ifdef ROM_I2SRxFIFOLimitGet
#define MAP_I2SRxFIFOLimitGet \
        ROM_I2SRxFIFOLimitGet
#else
#define MAP_I2SRxFIFOLimitGet \
        I2SRxFIFOLimitGet
#endif
#ifdef ROM_I2SRxFIFOLevelGet
#define MAP_I2SRxFIFOLevelGet \
        ROM_I2SRxFIFOLevelGet
#else
#define MAP_I2SRxFIFOLevelGet \
        I2SRxFIFOLevelGet
#endif
#ifdef ROM_I2STxRxEnable
#define MAP_I2STxRxEnable \
        ROM_I2STxRxEnable
#else
#define MAP_I2STxRxEnable \
        I2STxRxEnable
#endif
#ifdef ROM_I2STxRxDisable
#define MAP_I2STxRxDisable \
        ROM_I2STxRxDisable
#else
#define MAP_I2STxRxDisable \
        I2STxRxDisable
#endif
#ifdef ROM_I2STxRxConfigSet
#define MAP_I2STxRxConfigSet \
        ROM_I2STxRxConfigSet
#else
#define MAP_I2STxRxConfigSet \
        I2STxRxConfigSet
#endif
#ifdef ROM_I2SMasterClockSelect
#define MAP_I2SMasterClockSelect \
        ROM_I2SMasterClockSelect
#else
#define MAP_I2SMasterClockSelect \
        I2SMasterClockSelect
#endif
#ifdef ROM_I2SIntEnable
#define MAP_I2SIntEnable \
        ROM_I2SIntEnable
#else
#define MAP_I2SIntEnable \
        I2SIntEnable
#endif
#ifdef ROM_I2SIntDisable
#define MAP_I2SIntDisable \
        ROM_I2SIntDisable
#else
#define MAP_I2SIntDisable \
        I2SIntDisable
#endif
#ifdef ROM_I2SIntClear
#define MAP_I2SIntClear \
        ROM_I2SIntClear
#else
#define MAP_I2SIntClear \
        I2SIntClear
#endif

//*****************************************************************************
//
// Macros for the Interrupt API.
//
//*****************************************************************************
#ifdef ROM_IntEnable
#define MAP_IntEnable \
        ROM_IntEnable
#else
#define MAP_IntEnable \
        IntEnable
#endif
#ifdef ROM_IntMasterEnable
#define MAP_IntMasterEnable \
        ROM_IntMasterEnable
#else
#define MAP_IntMasterEnable \
        IntMasterEnable
#endif
#ifdef ROM_IntMasterDisable
#define MAP_IntMasterDisable \
        ROM_IntMasterDisable
#else
#define MAP_IntMasterDisable \
        IntMasterDisable
#endif
#ifdef ROM_IntDisable
#define MAP_IntDisable \
        ROM_IntDisable
#else
#define MAP_IntDisable \
        IntDisable
#endif
#ifdef ROM_IntPriorityGroupingSet
#define MAP_IntPriorityGroupingSet \
        ROM_IntPriorityGroupingSet
#else
#define MAP_IntPriorityGroupingSet \
        IntPriorityGroupingSet
#endif
#ifdef ROM_IntPriorityGroupingGet
#define MAP_IntPriorityGroupingGet \
        ROM_IntPriorityGroupingGet
#else
#define MAP_IntPriorityGroupingGet \
        IntPriorityGroupingGet
#endif
#ifdef ROM_IntPrioritySet
#define MAP_IntPrioritySet \
        ROM_IntPrioritySet
#else
#define MAP_IntPrioritySet \
        IntPrioritySet
#endif
#ifdef ROM_IntPriorityGet
#define MAP_IntPriorityGet \
        ROM_IntPriorityGet
#else
#define MAP_IntPriorityGet \
        IntPriorityGet
#endif
#ifdef ROM_IntPendSet
#define MAP_IntPendSet \
        ROM_IntPendSet
#else
#define MAP_IntPendSet \
        IntPendSet
#endif
#ifdef ROM_IntPendClear
#define MAP_IntPendClear \
        ROM_IntPendClear
#else
#define MAP_IntPendClear \
        IntPendClear
#endif
#ifdef ROM_IntPriorityMaskSet
#define MAP_IntPriorityMaskSet \
        ROM_IntPriorityMaskSet
#else
#define MAP_IntPriorityMaskSet \
        IntPriorityMaskSet
#endif
#ifdef ROM_IntPriorityMaskGet
#define MAP_IntPriorityMaskGet \
        ROM_IntPriorityMaskGet
#else
#define MAP_IntPriorityMaskGet \
        IntPriorityMaskGet
#endif

//*****************************************************************************
//
// Macros for the LPC API.
//
//*****************************************************************************
#ifdef ROM_LPCIntClear
#define MAP_LPCIntClear \
        ROM_LPCIntClear
#else
#define MAP_LPCIntClear \
        LPCIntClear
#endif
#ifdef ROM_LPCByteRead
#define MAP_LPCByteRead \
        ROM_LPCByteRead
#else
#define MAP_LPCByteRead \
        LPCByteRead
#endif
#ifdef ROM_LPCByteWrite
#define MAP_LPCByteWrite \
        ROM_LPCByteWrite
#else
#define MAP_LPCByteWrite \
        LPCByteWrite
#endif
#ifdef ROM_LPCChannelConfigCOMxSet
#define MAP_LPCChannelConfigCOMxSet \
        ROM_LPCChannelConfigCOMxSet
#else
#define MAP_LPCChannelConfigCOMxSet \
        LPCChannelConfigCOMxSet
#endif
#ifdef ROM_LPCChannelConfigGet
#define MAP_LPCChannelConfigGet \
        ROM_LPCChannelConfigGet
#else
#define MAP_LPCChannelConfigGet \
        LPCChannelConfigGet
#endif
#ifdef ROM_LPCChannelConfigEPSet
#define MAP_LPCChannelConfigEPSet \
        ROM_LPCChannelConfigEPSet
#else
#define MAP_LPCChannelConfigEPSet \
        LPCChannelConfigEPSet
#endif
#ifdef ROM_LPCChannelConfigMBSet
#define MAP_LPCChannelConfigMBSet \
        ROM_LPCChannelConfigMBSet
#else
#define MAP_LPCChannelConfigMBSet \
        LPCChannelConfigMBSet
#endif
#ifdef ROM_LPCChannelDMAConfigGet
#define MAP_LPCChannelDMAConfigGet \
        ROM_LPCChannelDMAConfigGet
#else
#define MAP_LPCChannelDMAConfigGet \
        LPCChannelDMAConfigGet
#endif
#ifdef ROM_LPCChannelDMAConfigSet
#define MAP_LPCChannelDMAConfigSet \
        ROM_LPCChannelDMAConfigSet
#else
#define MAP_LPCChannelDMAConfigSet \
        LPCChannelDMAConfigSet
#endif
#ifdef ROM_LPCChannelDisable
#define MAP_LPCChannelDisable \
        ROM_LPCChannelDisable
#else
#define MAP_LPCChannelDisable \
        LPCChannelDisable
#endif
#ifdef ROM_LPCChannelEnable
#define MAP_LPCChannelEnable \
        ROM_LPCChannelEnable
#else
#define MAP_LPCChannelEnable \
        LPCChannelEnable
#endif
#ifdef ROM_LPCChannelStatusClear
#define MAP_LPCChannelStatusClear \
        ROM_LPCChannelStatusClear
#else
#define MAP_LPCChannelStatusClear \
        LPCChannelStatusClear
#endif
#ifdef ROM_LPCChannelStatusGet
#define MAP_LPCChannelStatusGet \
        ROM_LPCChannelStatusGet
#else
#define MAP_LPCChannelStatusGet \
        LPCChannelStatusGet
#endif
#ifdef ROM_LPCChannelStatusSet
#define MAP_LPCChannelStatusSet \
        ROM_LPCChannelStatusSet
#else
#define MAP_LPCChannelStatusSet \
        LPCChannelStatusSet
#endif
#ifdef ROM_LPCCOMxIntClear
#define MAP_LPCCOMxIntClear \
        ROM_LPCCOMxIntClear
#else
#define MAP_LPCCOMxIntClear \
        LPCCOMxIntClear
#endif
#ifdef ROM_LPCCOMxIntDisable
#define MAP_LPCCOMxIntDisable \
        ROM_LPCCOMxIntDisable
#else
#define MAP_LPCCOMxIntDisable \
        LPCCOMxIntDisable
#endif
#ifdef ROM_LPCCOMxIntEnable
#define MAP_LPCCOMxIntEnable \
        ROM_LPCCOMxIntEnable
#else
#define MAP_LPCCOMxIntEnable \
        LPCCOMxIntEnable
#endif
#ifdef ROM_LPCCOMxIntStatus
#define MAP_LPCCOMxIntStatus \
        ROM_LPCCOMxIntStatus
#else
#define MAP_LPCCOMxIntStatus \
        LPCCOMxIntStatus
#endif
#ifdef ROM_LPCConfigGet
#define MAP_LPCConfigGet \
        ROM_LPCConfigGet
#else
#define MAP_LPCConfigGet \
        LPCConfigGet
#endif
#ifdef ROM_LPCConfigSet
#define MAP_LPCConfigSet \
        ROM_LPCConfigSet
#else
#define MAP_LPCConfigSet \
        LPCConfigSet
#endif
#ifdef ROM_LPCHalfWordRead
#define MAP_LPCHalfWordRead \
        ROM_LPCHalfWordRead
#else
#define MAP_LPCHalfWordRead \
        LPCHalfWordRead
#endif
#ifdef ROM_LPCHalfWordWrite
#define MAP_LPCHalfWordWrite \
        ROM_LPCHalfWordWrite
#else
#define MAP_LPCHalfWordWrite \
        LPCHalfWordWrite
#endif
#ifdef ROM_LPCIRQClear
#define MAP_LPCIRQClear \
        ROM_LPCIRQClear
#else
#define MAP_LPCIRQClear \
        LPCIRQClear
#endif
#ifdef ROM_LPCIRQConfig
#define MAP_LPCIRQConfig \
        ROM_LPCIRQConfig
#else
#define MAP_LPCIRQConfig \
        LPCIRQConfig
#endif
#ifdef ROM_LPCIRQGet
#define MAP_LPCIRQGet \
        ROM_LPCIRQGet
#else
#define MAP_LPCIRQGet \
        LPCIRQGet
#endif
#ifdef ROM_LPCIRQSend
#define MAP_LPCIRQSend \
        ROM_LPCIRQSend
#else
#define MAP_LPCIRQSend \
        LPCIRQSend
#endif
#ifdef ROM_LPCIRQSet
#define MAP_LPCIRQSet \
        ROM_LPCIRQSet
#else
#define MAP_LPCIRQSet \
        LPCIRQSet
#endif
#ifdef ROM_LPCIntDisable
#define MAP_LPCIntDisable \
        ROM_LPCIntDisable
#else
#define MAP_LPCIntDisable \
        LPCIntDisable
#endif
#ifdef ROM_LPCIntEnable
#define MAP_LPCIntEnable \
        ROM_LPCIntEnable
#else
#define MAP_LPCIntEnable \
        LPCIntEnable
#endif
#ifdef ROM_LPCIntStatus
#define MAP_LPCIntStatus \
        ROM_LPCIntStatus
#else
#define MAP_LPCIntStatus \
        LPCIntStatus
#endif
#ifdef ROM_LPCSCIAssert
#define MAP_LPCSCIAssert \
        ROM_LPCSCIAssert
#else
#define MAP_LPCSCIAssert \
        LPCSCIAssert
#endif
#ifdef ROM_LPCStatusGet
#define MAP_LPCStatusGet \
        ROM_LPCStatusGet
#else
#define MAP_LPCStatusGet \
        LPCStatusGet
#endif
#ifdef ROM_LPCWordRead
#define MAP_LPCWordRead \
        ROM_LPCWordRead
#else
#define MAP_LPCWordRead \
        LPCWordRead
#endif
#ifdef ROM_LPCWordWrite
#define MAP_LPCWordWrite \
        ROM_LPCWordWrite
#else
#define MAP_LPCWordWrite \
        LPCWordWrite
#endif
#ifdef ROM_LPCChannelPoolAddressGet
#define MAP_LPCChannelPoolAddressGet \
        ROM_LPCChannelPoolAddressGet
#else
#define MAP_LPCChannelPoolAddressGet \
        LPCChannelPoolAddressGet
#endif
#ifdef ROM_LPCStatusBlockAddressGet
#define MAP_LPCStatusBlockAddressGet \
        ROM_LPCStatusBlockAddressGet
#else
#define MAP_LPCStatusBlockAddressGet \
        LPCStatusBlockAddressGet
#endif
#ifdef ROM_LPCStatusBlockAddressSet
#define MAP_LPCStatusBlockAddressSet \
        ROM_LPCStatusBlockAddressSet
#else
#define MAP_LPCStatusBlockAddressSet \
        LPCStatusBlockAddressSet
#endif

//*****************************************************************************
//
// Macros for the MPU API.
//
//*****************************************************************************
#ifdef ROM_MPUEnable
#define MAP_MPUEnable \
        ROM_MPUEnable
#else
#define MAP_MPUEnable \
        MPUEnable
#endif
#ifdef ROM_MPUDisable
#define MAP_MPUDisable \
        ROM_MPUDisable
#else
#define MAP_MPUDisable \
        MPUDisable
#endif
#ifdef ROM_MPURegionCountGet
#define MAP_MPURegionCountGet \
        ROM_MPURegionCountGet
#else
#define MAP_MPURegionCountGet \
        MPURegionCountGet
#endif
#ifdef ROM_MPURegionEnable
#define MAP_MPURegionEnable \
        ROM_MPURegionEnable
#else
#define MAP_MPURegionEnable \
        MPURegionEnable
#endif
#ifdef ROM_MPURegionDisable
#define MAP_MPURegionDisable \
        ROM_MPURegionDisable
#else
#define MAP_MPURegionDisable \
        MPURegionDisable
#endif
#ifdef ROM_MPURegionSet
#define MAP_MPURegionSet \
        ROM_MPURegionSet
#else
#define MAP_MPURegionSet \
        MPURegionSet
#endif
#ifdef ROM_MPURegionGet
#define MAP_MPURegionGet \
        ROM_MPURegionGet
#else
#define MAP_MPURegionGet \
        MPURegionGet
#endif

//*****************************************************************************
//
// Macros for the PECI API.
//
//*****************************************************************************
#ifdef ROM_PECIIntClear
#define MAP_PECIIntClear \
        ROM_PECIIntClear
#else
#define MAP_PECIIntClear \
        PECIIntClear
#endif
#ifdef ROM_PECIAdvCmdSend
#define MAP_PECIAdvCmdSend \
        ROM_PECIAdvCmdSend
#else
#define MAP_PECIAdvCmdSend \
        PECIAdvCmdSend
#endif
#ifdef ROM_PECIAdvCmdSendNonBlocking
#define MAP_PECIAdvCmdSendNonBlocking \
        ROM_PECIAdvCmdSendNonBlocking
#else
#define MAP_PECIAdvCmdSendNonBlocking \
        PECIAdvCmdSendNonBlocking
#endif
#ifdef ROM_PECIAdvCmdStatusGet
#define MAP_PECIAdvCmdStatusGet \
        ROM_PECIAdvCmdStatusGet
#else
#define MAP_PECIAdvCmdStatusGet \
        PECIAdvCmdStatusGet
#endif
#ifdef ROM_PECIConfigGet
#define MAP_PECIConfigGet \
        ROM_PECIConfigGet
#else
#define MAP_PECIConfigGet \
        PECIConfigGet
#endif
#ifdef ROM_PECIConfigSet
#define MAP_PECIConfigSet \
        ROM_PECIConfigSet
#else
#define MAP_PECIConfigSet \
        PECIConfigSet
#endif
#ifdef ROM_PECIDomainMaxReadClear
#define MAP_PECIDomainMaxReadClear \
        ROM_PECIDomainMaxReadClear
#else
#define MAP_PECIDomainMaxReadClear \
        PECIDomainMaxReadClear
#endif
#ifdef ROM_PECIDomainValueClear
#define MAP_PECIDomainValueClear \
        ROM_PECIDomainValueClear
#else
#define MAP_PECIDomainValueClear \
        PECIDomainValueClear
#endif
#ifdef ROM_PECIDomainConfigGet
#define MAP_PECIDomainConfigGet \
        ROM_PECIDomainConfigGet
#else
#define MAP_PECIDomainConfigGet \
        PECIDomainConfigGet
#endif
#ifdef ROM_PECIDomainConfigSet
#define MAP_PECIDomainConfigSet \
        ROM_PECIDomainConfigSet
#else
#define MAP_PECIDomainConfigSet \
        PECIDomainConfigSet
#endif
#ifdef ROM_PECIDomainDisable
#define MAP_PECIDomainDisable \
        ROM_PECIDomainDisable
#else
#define MAP_PECIDomainDisable \
        PECIDomainDisable
#endif
#ifdef ROM_PECIDomainEnable
#define MAP_PECIDomainEnable \
        ROM_PECIDomainEnable
#else
#define MAP_PECIDomainEnable \
        PECIDomainEnable
#endif
#ifdef ROM_PECIDomainMaxReadGet
#define MAP_PECIDomainMaxReadGet \
        ROM_PECIDomainMaxReadGet
#else
#define MAP_PECIDomainMaxReadGet \
        PECIDomainMaxReadGet
#endif
#ifdef ROM_PECIDomainValueGet
#define MAP_PECIDomainValueGet \
        ROM_PECIDomainValueGet
#else
#define MAP_PECIDomainValueGet \
        PECIDomainValueGet
#endif
#ifdef ROM_PECIIntDisable
#define MAP_PECIIntDisable \
        ROM_PECIIntDisable
#else
#define MAP_PECIIntDisable \
        PECIIntDisable
#endif
#ifdef ROM_PECIIntEnable
#define MAP_PECIIntEnable \
        ROM_PECIIntEnable
#else
#define MAP_PECIIntEnable \
        PECIIntEnable
#endif
#ifdef ROM_PECIIntStatus
#define MAP_PECIIntStatus \
        ROM_PECIIntStatus
#else
#define MAP_PECIIntStatus \
        PECIIntStatus
#endif
#ifdef ROM_PECIBypassEnable
#define MAP_PECIBypassEnable \
        ROM_PECIBypassEnable
#else
#define MAP_PECIBypassEnable \
        PECIBypassEnable
#endif
#ifdef ROM_PECIBypassDisable
#define MAP_PECIBypassDisable \
        ROM_PECIBypassDisable
#else
#define MAP_PECIBypassDisable \
        PECIBypassDisable
#endif

