RT-Thread/rt-thread/bsp/tms320f28379d/libraries/common/deprecated/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the PWM API.
//
//*****************************************************************************
#ifdef ROM_PWMPulseWidthSet
#define MAP_PWMPulseWidthSet \
        ROM_PWMPulseWidthSet
#else
#define MAP_PWMPulseWidthSet \
        PWMPulseWidthSet
#endif
#ifdef ROM_PWMGenConfigure
#define MAP_PWMGenConfigure \
        ROM_PWMGenConfigure
#else
#define MAP_PWMGenConfigure \
        PWMGenConfigure
#endif
#ifdef ROM_PWMGenPeriodSet
#define MAP_PWMGenPeriodSet \
        ROM_PWMGenPeriodSet
#else
#define MAP_PWMGenPeriodSet \
        PWMGenPeriodSet
#endif
#ifdef ROM_PWMGenPeriodGet
#define MAP_PWMGenPeriodGet \
        ROM_PWMGenPeriodGet
#else
#define MAP_PWMGenPeriodGet \
        PWMGenPeriodGet
#endif
#ifdef ROM_PWMGenEnable
#define MAP_PWMGenEnable \
        ROM_PWMGenEnable
#else
#define MAP_PWMGenEnable \
        PWMGenEnable
#endif
#ifdef ROM_PWMGenDisable
#define MAP_PWMGenDisable \
        ROM_PWMGenDisable
#else
#define MAP_PWMGenDisable \
        PWMGenDisable
#endif
#ifdef ROM_PWMPulseWidthGet
#define MAP_PWMPulseWidthGet \
        ROM_PWMPulseWidthGet
#else
#define MAP_PWMPulseWidthGet \
        PWMPulseWidthGet
#endif
#ifdef ROM_PWMDeadBandEnable
#define MAP_PWMDeadBandEnable \
        ROM_PWMDeadBandEnable
#else
#define MAP_PWMDeadBandEnable \
        PWMDeadBandEnable
#endif
#ifdef ROM_PWMDeadBandDisable
#define MAP_PWMDeadBandDisable \
        ROM_PWMDeadBandDisable
#else
#define MAP_PWMDeadBandDisable \
        PWMDeadBandDisable
#endif
#ifdef ROM_PWMSyncUpdate
#define MAP_PWMSyncUpdate \
        ROM_PWMSyncUpdate
#else
#define MAP_PWMSyncUpdate \
        PWMSyncUpdate
#endif
#ifdef ROM_PWMSyncTimeBase
#define MAP_PWMSyncTimeBase \
        ROM_PWMSyncTimeBase
#else
#define MAP_PWMSyncTimeBase \
        PWMSyncTimeBase
#endif
#ifdef ROM_PWMOutputState
#define MAP_PWMOutputState \
        ROM_PWMOutputState
#else
#define MAP_PWMOutputState \
        PWMOutputState
#endif
#ifdef ROM_PWMOutputInvert
#define MAP_PWMOutputInvert \
        ROM_PWMOutputInvert
#else
#define MAP_PWMOutputInvert \
        PWMOutputInvert
#endif
#ifdef ROM_PWMOutputFault
#define MAP_PWMOutputFault \
        ROM_PWMOutputFault
#else
#define MAP_PWMOutputFault \
        PWMOutputFault
#endif
#ifdef ROM_PWMGenIntTrigEnable
#define MAP_PWMGenIntTrigEnable \
        ROM_PWMGenIntTrigEnable
#else
#define MAP_PWMGenIntTrigEnable \
        PWMGenIntTrigEnable
#endif
#ifdef ROM_PWMGenIntTrigDisable
#define MAP_PWMGenIntTrigDisable \
        ROM_PWMGenIntTrigDisable
#else
#define MAP_PWMGenIntTrigDisable \
        PWMGenIntTrigDisable
#endif
#ifdef ROM_PWMGenIntStatus
#define MAP_PWMGenIntStatus \
        ROM_PWMGenIntStatus
#else
#define MAP_PWMGenIntStatus \
        PWMGenIntStatus
#endif
#ifdef ROM_PWMGenIntClear
#define MAP_PWMGenIntClear \
        ROM_PWMGenIntClear
#else
#define MAP_PWMGenIntClear \
        PWMGenIntClear
#endif
#ifdef ROM_PWMIntEnable
#define MAP_PWMIntEnable \
        ROM_PWMIntEnable
#else
#define MAP_PWMIntEnable \
        PWMIntEnable
#endif
#ifdef ROM_PWMIntDisable
#define MAP_PWMIntDisable \
        ROM_PWMIntDisable
#else
#define MAP_PWMIntDisable \
        PWMIntDisable
#endif
#ifdef ROM_PWMFaultIntClear
#define MAP_PWMFaultIntClear \
        ROM_PWMFaultIntClear
#else
#define MAP_PWMFaultIntClear \
        PWMFaultIntClear
#endif
#ifdef ROM_PWMIntStatus
#define MAP_PWMIntStatus \
        ROM_PWMIntStatus
#else
#define MAP_PWMIntStatus \
        PWMIntStatus
#endif
#ifdef ROM_PWMOutputFaultLevel
#define MAP_PWMOutputFaultLevel \
        ROM_PWMOutputFaultLevel
#else
#define MAP_PWMOutputFaultLevel \
        PWMOutputFaultLevel
#endif
#ifdef ROM_PWMFaultIntClearExt
#define MAP_PWMFaultIntClearExt \
        ROM_PWMFaultIntClearExt
#else
#define MAP_PWMFaultIntClearExt \
        PWMFaultIntClearExt
#endif
#ifdef ROM_PWMGenFaultConfigure
#define MAP_PWMGenFaultConfigure \
        ROM_PWMGenFaultConfigure
#else
#define MAP_PWMGenFaultConfigure \
        PWMGenFaultConfigure
#endif
#ifdef ROM_PWMGenFaultTriggerSet
#define MAP_PWMGenFaultTriggerSet \
        ROM_PWMGenFaultTriggerSet
#else
#define MAP_PWMGenFaultTriggerSet \
        PWMGenFaultTriggerSet
#endif
#ifdef ROM_PWMGenFaultTriggerGet
#define MAP_PWMGenFaultTriggerGet \
        ROM_PWMGenFaultTriggerGet
#else
#define MAP_PWMGenFaultTriggerGet \
        PWMGenFaultTriggerGet
#endif
#ifdef ROM_PWMGenFaultStatus
#define MAP_PWMGenFaultStatus \
        ROM_PWMGenFaultStatus
#else
#define MAP_PWMGenFaultStatus \
        PWMGenFaultStatus
#endif
#ifdef ROM_PWMGenFaultClear
#define MAP_PWMGenFaultClear \
        ROM_PWMGenFaultClear
#else
#define MAP_PWMGenFaultClear \
        PWMGenFaultClear
#endif

//*****************************************************************************
//
// Macros for the QEI API.
//
//*****************************************************************************
#ifdef ROM_QEIPositionGet
#define MAP_QEIPositionGet \
        ROM_QEIPositionGet
#else
#define MAP_QEIPositionGet \
        QEIPositionGet
#endif
#ifdef ROM_QEIEnable
#define MAP_QEIEnable \
        ROM_QEIEnable
#else
#define MAP_QEIEnable \
        QEIEnable
#endif
#ifdef ROM_QEIDisable
#define MAP_QEIDisable \
        ROM_QEIDisable
#else
#define MAP_QEIDisable \
        QEIDisable
#endif
#ifdef ROM_QEIConfigure
#define MAP_QEIConfigure \
        ROM_QEIConfigure
#else
#define MAP_QEIConfigure \
        QEIConfigure
#endif
#ifdef ROM_QEIPositionSet
#define MAP_QEIPositionSet \
        ROM_QEIPositionSet
#else
#define MAP_QEIPositionSet \
        QEIPositionSet
#endif
#ifdef ROM_QEIDirectionGet
#define MAP_QEIDirectionGet \
        ROM_QEIDirectionGet
#else
#define MAP_QEIDirectionGet \
        QEIDirectionGet
#endif
#ifdef ROM_QEIErrorGet
#define MAP_QEIErrorGet \
        ROM_QEIErrorGet
#else
#define MAP_QEIErrorGet \
        QEIErrorGet
#endif
#ifdef ROM_QEIVelocityEnable
#define MAP_QEIVelocityEnable \
        ROM_QEIVelocityEnable
#else
#define MAP_QEIVelocityEnable \
        QEIVelocityEnable
#endif
#ifdef ROM_QEIVelocityDisable
#define MAP_QEIVelocityDisable \
        ROM_QEIVelocityDisable
#else
#define MAP_QEIVelocityDisable \
        QEIVelocityDisable
#endif
#ifdef ROM_QEIVelocityConfigure
#define MAP_QEIVelocityConfigure \
        ROM_QEIVelocityConfigure
#else
#define MAP_QEIVelocityConfigure \
        QEIVelocityConfigure
#endif
#ifdef ROM_QEIVelocityGet
#define MAP_QEIVelocityGet \
        ROM_QEIVelocityGet
#else
#define MAP_QEIVelocityGet \
        QEIVelocityGet
#endif
#ifdef ROM_QEIIntEnable
#define MAP_QEIIntEnable \
        ROM_QEIIntEnable
#else
#define MAP_QEIIntEnable \
        QEIIntEnable
#endif
#ifdef ROM_QEIIntDisable
#define MAP_QEIIntDisable \
        ROM_QEIIntDisable
#else
#define MAP_QEIIntDisable \
        QEIIntDisable
#endif
#ifdef ROM_QEIIntStatus
#define MAP_QEIIntStatus \
        ROM_QEIIntStatus
#else
#define MAP_QEIIntStatus \
        QEIIntStatus
#endif
#ifdef ROM_QEIIntClear
#define MAP_QEIIntClear \
        ROM_QEIIntClear
#else
#define MAP_QEIIntClear \
        QEIIntClear
#endif

//*****************************************************************************
//
// Macros for the SMBus API.
//
//*****************************************************************************
#ifdef ROM_SMBusMasterIntProcess
#define MAP_SMBusMasterIntProcess \
        ROM_SMBusMasterIntProcess
#else
#define MAP_SMBusMasterIntProcess \
        SMBusMasterIntProcess
#endif
#ifdef ROM_SMBusARPDisable
#define MAP_SMBusARPDisable \
        ROM_SMBusARPDisable
#else
#define MAP_SMBusARPDisable \
        SMBusARPDisable
#endif
#ifdef ROM_SMBusARPEnable
#define MAP_SMBusARPEnable \
        ROM_SMBusARPEnable
#else
#define MAP_SMBusARPEnable \
        SMBusARPEnable
#endif
#ifdef ROM_SMBusARPUDIDPacketDecode
#define MAP_SMBusARPUDIDPacketDecode \
        ROM_SMBusARPUDIDPacketDecode
#else
#define MAP_SMBusARPUDIDPacketDecode \
        SMBusARPUDIDPacketDecode
#endif
#ifdef ROM_SMBusARPUDIDPacketEncode
#define MAP_SMBusARPUDIDPacketEncode \
        ROM_SMBusARPUDIDPacketEncode
#else
#define MAP_SMBusARPUDIDPacketEncode \
        SMBusARPUDIDPacketEncode
#endif
#ifdef ROM_SMBusMasterARPAssignAddress
#define MAP_SMBusMasterARPAssignAddress \
        ROM_SMBusMasterARPAssignAddress
#else
#define MAP_SMBusMasterARPAssignAddress \
        SMBusMasterARPAssignAddress
#endif
#ifdef ROM_SMBusMasterARPGetUDIDDir
#define MAP_SMBusMasterARPGetUDIDDir \
        ROM_SMBusMasterARPGetUDIDDir
#else
#define MAP_SMBusMasterARPGetUDIDDir \
        SMBusMasterARPGetUDIDDir
#endif
#ifdef ROM_SMBusMasterARPGetUDIDGen
#define MAP_SMBusMasterARPGetUDIDGen \
        ROM_SMBusMasterARPGetUDIDGen
#else
#define MAP_SMBusMasterARPGetUDIDGen \
        SMBusMasterARPGetUDIDGen
#endif
#ifdef ROM_SMBusMasterARPNotifyMaster
#define MAP_SMBusMasterARPNotifyMaster \
        ROM_SMBusMasterARPNotifyMaster
#else
#define MAP_SMBusMasterARPNotifyMaster \
        SMBusMasterARPNotifyMaster
#endif
#ifdef ROM_SMBusMasterARPPrepareToARP
#define MAP_SMBusMasterARPPrepareToARP \
        ROM_SMBusMasterARPPrepareToARP
#else
#define MAP_SMBusMasterARPPrepareToARP \
        SMBusMasterARPPrepareToARP
#endif
#ifdef ROM_SMBusMasterARPResetDeviceDir
#define MAP_SMBusMasterARPResetDeviceDir \
        ROM_SMBusMasterARPResetDeviceDir
#else
#define MAP_SMBusMasterARPResetDeviceDir \
        SMBusMasterARPResetDeviceDir
#endif
#ifdef ROM_SMBusMasterARPResetDeviceGen
#define MAP_SMBusMasterARPResetDeviceGen \
        ROM_SMBusMasterARPResetDeviceGen
#else
#define MAP_SMBusMasterARPResetDeviceGen \
        SMBusMasterARPResetDeviceGen
#endif
#ifdef ROM_SMBusMasterBlockProcessCall
#define MAP_SMBusMasterBlockProcessCall \
        ROM_SMBusMasterBlockProcessCall
#else
#define MAP_SMBusMasterBlockProcessCall \
        SMBusMasterBlockProcessCall
#endif
#ifdef ROM_SMBusMasterBlockRead
#define MAP_SMBusMasterBlockRead \
        ROM_SMBusMasterBlockRead
#else
#define MAP_SMBusMasterBlockRead \
        SMBusMasterBlockRead
#endif
#ifdef ROM_SMBusMasterBlockWrite
#define MAP_SMBusMasterBlockWrite \
        ROM_SMBusMasterBlockWrite
#else
#define MAP_SMBusMasterBlockWrite \
        SMBusMasterBlockWrite
#endif
#ifdef ROM_SMBusMasterByteReceive
#define MAP_SMBusMasterByteReceive \
        ROM_SMBusMasterByteReceive
#else
#define MAP_SMBusMasterByteReceive \
        SMBusMasterByteReceive
#endif
#ifdef ROM_SMBusMasterByteSend
#define MAP_SMBusMasterByteSend \
        ROM_SMBusMasterByteSend
#else
#define MAP_SMBusMasterByteSend \
        SMBusMasterByteSend
#endif
#ifdef ROM_SMBusMasterByteWordRead
#define MAP_SMBusMasterByteWordRead \
        ROM_SMBusMasterByteWordRead
#else
#define MAP_SMBusMasterByteWordRead \
        SMBusMasterByteWordRead
#endif
#ifdef ROM_SMBusMasterByteWordWrite
#define MAP_SMBusMasterByteWordWrite \
        ROM_SMBusMasterByteWordWrite
#else
#define MAP_SMBusMasterByteWordWrite \
        SMBusMasterByteWordWrite
#endif
#ifdef ROM_SMBusMasterHostNotify
#define MAP_SMBusMasterHostNotify \
        ROM_SMBusMasterHostNotify
#else
#define MAP_SMBusMasterHostNotify \
        SMBusMasterHostNotify
#endif
#ifdef ROM_SMBusMasterI2CRead
#define MAP_SMBusMasterI2CRead \
        ROM_SMBusMasterI2CRead
#else
#define MAP_SMBusMasterI2CRead \
        SMBusMasterI2CRead
#endif
#ifdef ROM_SMBusMasterI2CWrite
#define MAP_SMBusMasterI2CWrite \
        ROM_SMBusMasterI2CWrite
#else
#define MAP_SMBusMasterI2CWrite \
        SMBusMasterI2CWrite
#endif
#ifdef ROM_SMBusMasterI2CWriteRead
#define MAP_SMBusMasterI2CWriteRead \
        ROM_SMBusMasterI2CWriteRead
#else
#define MAP_SMBusMasterI2CWriteRead \
        SMBusMasterI2CWriteRead
#endif
#ifdef ROM_SMBusMasterInit
#define MAP_SMBusMasterInit \
        ROM_SMBusMasterInit
#else
#define MAP_SMBusMasterInit \
        SMBusMasterInit
#endif
#ifdef ROM_SMBusMasterIntEnable
#define MAP_SMBusMasterIntEnable \
        ROM_SMBusMasterIntEnable
#else
#define MAP_SMBusMasterIntEnable \
        SMBusMasterIntEnable
#endif
#ifdef ROM_SMBusMasterProcessCall
#define MAP_SMBusMasterProcessCall \
        ROM_SMBusMasterProcessCall
#else
#define MAP_SMBusMasterProcessCall \
        SMBusMasterProcessCall
#endif
#ifdef ROM_SMBusMasterQuickCommand
#define MAP_SMBusMasterQuickCommand \
        ROM_SMBusMasterQuickCommand
#else
#define MAP_SMBusMasterQuickCommand \
        SMBusMasterQuickCommand
#endif
#ifdef ROM_SMBusPECDisable
#define MAP_SMBusPECDisable \
        ROM_SMBusPECDisable
#else
#define MAP_SMBusPECDisable \
        SMBusPECDisable
#endif
#ifdef ROM_SMBusPECEnable
#define MAP_SMBusPECEnable \
        ROM_SMBusPECEnable
#else
#define MAP_SMBusPECEnable \
        SMBusPECEnable
#endif
#ifdef ROM_SMBusRxPacketSizeGet
#define MAP_SMBusRxPacketSizeGet \
        ROM_SMBusRxPacketSizeGet
#else
#define MAP_SMBusRxPacketSizeGet \
        SMBusRxPacketSizeGet
#endif
#ifdef ROM_SMBusSlaveACKSend
#define MAP_SMBusSlaveACKSend \
        ROM_SMBusSlaveACKSend
#else
#define MAP_SMBusSlaveACKSend \
        SMBusSlaveACKSend
#endif
#ifdef ROM_SMBusSlaveAddressSet
#define MAP_SMBusSlaveAddressSet \
        ROM_SMBusSlaveAddressSet
#else
#define MAP_SMBusSlaveAddressSet \
        SMBusSlaveAddressSet
#endif
#ifdef ROM_SMBusSlaveARPFlagARGet
#define MAP_SMBusSlaveARPFlagARGet \
        ROM_SMBusSlaveARPFlagARGet
#else
#define MAP_SMBusSlaveARPFlagARGet \
        SMBusSlaveARPFlagARGet
#endif
#ifdef ROM_SMBusSlaveARPFlagARSet
#define MAP_SMBusSlaveARPFlagARSet \
        ROM_SMBusSlaveARPFlagARSet
#else
#define MAP_SMBusSlaveARPFlagARSet \
        SMBusSlaveARPFlagARSet
#endif
#ifdef ROM_SMBusSlaveARPFlagAVGet
#define MAP_SMBusSlaveARPFlagAVGet \
        ROM_SMBusSlaveARPFlagAVGet
#else
#define MAP_SMBusSlaveARPFlagAVGet \
        SMBusSlaveARPFlagAVGet
#endif
#ifdef ROM_SMBusSlaveARPFlagAVSet
#define MAP_SMBusSlaveARPFlagAVSet \
        ROM_SMBusSlaveARPFlagAVSet
#else
#define MAP_SMBusSlaveARPFlagAVSet \
        SMBusSlaveARPFlagAVSet
#endif
#ifdef ROM_SMBusSlaveBlockTransferDisable
#define MAP_SMBusSlaveBlockTransferDisable \
        ROM_SMBusSlaveBlockTransferDisable
#else
#define MAP_SMBusSlaveBlockTransferDisable \
        SMBusSlaveBlockTransferDisable
#endif
#ifdef ROM_SMBusSlaveBlockTransferEnable
#define MAP_SMBusSlaveBlockTransferEnable \
        ROM_SMBusSlaveBlockTransferEnable
#else
#define MAP_SMBusSlaveBlockTransferEnable \
        SMBusSlaveBlockTransferEnable
#endif
#ifdef ROM_SMBusSlaveCommandGet
#define MAP_SMBusSlaveCommandGet \
        ROM_SMBusSlaveCommandGet
#else
#define MAP_SMBusSlaveCommandGet \
        SMBusSlaveCommandGet
#endif
#ifdef ROM_SMBusSlaveI2CDisable
#define MAP_SMBusSlaveI2CDisable \
        ROM_SMBusSlaveI2CDisable
#else
#define MAP_SMBusSlaveI2CDisable \
        SMBusSlaveI2CDisable
#endif
#ifdef ROM_SMBusSlaveI2CEnable
#define MAP_SMBusSlaveI2CEnable \
        ROM_SMBusSlaveI2CEnable
#else
#define MAP_SMBusSlaveI2CEnable \
        SMBusSlaveI2CEnable
#endif
#ifdef ROM_SMBusSlaveInit
#define MAP_SMBusSlaveInit \
        ROM_SMBusSlaveInit
#else
#define MAP_SMBusSlaveInit \
        SMBusSlaveInit
#endif
#ifdef ROM_SMBusSlaveIntAddressGet
#define MAP_SMBusSlaveIntAddressGet \
        ROM_SMBusSlaveIntAddressGet
#else
#define MAP_SMBusSlaveIntAddressGet \
        SMBusSlaveIntAddressGet
#endif
#ifdef ROM_SMBusSlaveIntEnable
#define MAP_SMBusSlaveIntEnable \
        ROM_SMBusSlaveIntEnable
#else
#define MAP_SMBusSlaveIntEnable \
        SMBusSlaveIntEnable
#endif
#ifdef ROM_SMBusSlaveIntProcess
#define MAP_SMBusSlaveIntProcess \
        ROM_SMBusSlaveIntProcess
#else
#define MAP_SMBusSlaveIntProcess \
        SMBusSlaveIntProcess
#endif
#ifdef ROM_SMBusSlaveManualACKDisable
#define MAP_SMBusSlaveManualACKDisable \
        ROM_SMBusSlaveManualACKDisable
#else
#define MAP_SMBusSlaveManualACKDisable \
        SMBusSlaveManualACKDisable
#endif
#ifdef ROM_SMBusSlaveManualACKEnable
#define MAP_SMBusSlaveManualACKEnable \
        ROM_SMBusSlaveManualACKEnable
#else
#define MAP_SMBusSlaveManualACKEnable \
        SMBusSlaveManualACKEnable
#endif
#ifdef ROM_SMBusSlaveManualACKStatusGet
#define MAP_SMBusSlaveManualACKStatusGet \
        ROM_SMBusSlaveManualACKStatusGet
#else
#define MAP_SMBusSlaveManualACKStatusGet \
        SMBusSlaveManualACKStatusGet
#endif
#ifdef ROM_SMBusSlaveProcessCallDisable
#define MAP_SMBusSlaveProcessCallDisable \
        ROM_SMBusSlaveProcessCallDisable
#else
#define MAP_SMBusSlaveProcessCallDisable \
        SMBusSlaveProcessCallDisable
#endif
#ifdef ROM_SMBusSlaveProcessCallEnable
#define MAP_SMBusSlaveProcessCallEnable \
        ROM_SMBusSlaveProcessCallEnable
#else
#define MAP_SMBusSlaveProcessCallEnable \
        SMBusSlaveProcessCallEnable
#endif
#ifdef ROM_SMBusSlaveRxBufferSet
#define MAP_SMBusSlaveRxBufferSet \
        ROM_SMBusSlaveRxBufferSet
#else
#define MAP_SMBusSlaveRxBufferSet \
        SMBusSlaveRxBufferSet
#endif
#ifdef ROM_SMBusSlaveTransferInit
#define MAP_SMBusSlaveTransferInit \
        ROM_SMBusSlaveTransferInit
#else
#define MAP_SMBusSlaveTransferInit \
        SMBusSlaveTransferInit
#endif
#ifdef ROM_SMBusSlaveTxBufferSet
#define MAP_SMBusSlaveTxBufferSet \
        ROM_SMBusSlaveTxBufferSet
#else
#define MAP_SMBusSlaveTxBufferSet \
        SMBusSlaveTxBufferSet
#endif
#ifdef ROM_SMBusSlaveUDIDSet
#define MAP_SMBusSlaveUDIDSet \
        ROM_SMBusSlaveUDIDSet
#else
#define MAP_SMBusSlaveUDIDSet \
        SMBusSlaveUDIDSet
#endif
#ifdef ROM_SMBusStatusGet
#define MAP_SMBusStatusGet \
        ROM_SMBusStatusGet
#else
#define MAP_SMBusStatusGet \
        SMBusStatusGet
#endif
#ifdef ROM_SMBusSlaveDataSend
#define MAP_SMBusSlaveDataSend \
        ROM_SMBusSlaveDataSend
#else
#define MAP_SMBusSlaveDataSend \
        SMBusSlaveDataSend
#endif

//*****************************************************************************
//
// Macros for the SSI API.
//
//*****************************************************************************
#ifdef ROM_SSIDataPut
#define MAP_SSIDataPut \
        ROM_SSIDataPut
#else
#define MAP_SSIDataPut \
        SSIDataPut
#endif
#ifdef ROM_SSIConfigSetExpClk
#define MAP_SSIConfigSetExpClk \
        ROM_SSIConfigSetExpClk
#else
#define MAP_SSIConfigSetExpClk \
        SSIConfigSetExpClk
#endif
#ifdef ROM_SSIEnable
#define MAP_SSIEnable \
        ROM_SSIEnable
#else
#define MAP_SSIEnable \
        SSIEnable
#endif
#ifdef ROM_SSIDisable
#define MAP_SSIDisable \
        ROM_SSIDisable
#else
#define MAP_SSIDisable \
        SSIDisable
#endif
#ifdef ROM_SSIIntEnable
#define MAP_SSIIntEnable \
        ROM_SSIIntEnable
#else
#define MAP_SSIIntEnable \
        SSIIntEnable
#endif
#ifdef ROM_SSIIntDisable
#define MAP_SSIIntDisable \
        ROM_SSIIntDisable
#else
#define MAP_SSIIntDisable \
        SSIIntDisable
#endif
#ifdef ROM_SSIIntStatus
#define MAP_SSIIntStatus \
        ROM_SSIIntStatus
#else
#define MAP_SSIIntStatus \
        SSIIntStatus
#endif
#ifdef ROM_SSIIntClear
#define MAP_SSIIntClear \
        ROM_SSIIntClear
#else
#define MAP_SSIIntClear \
        SSIIntClear
#endif
#ifdef ROM_SSIDataPutNonBlocking
#define MAP_SSIDataPutNonBlocking \
        ROM_SSIDataPutNonBlocking
#else
#define MAP_SSIDataPutNonBlocking \
        SSIDataPutNonBlocking
#endif
#ifdef ROM_SSIDataGet
#define MAP_SSIDataGet \
        ROM_SSIDataGet
#else
#define MAP_SSIDataGet \
        SSIDataGet
#endif
#ifdef ROM_SSIDataGetNonBlocking
#define MAP_SSIDataGetNonBlocking \
        ROM_SSIDataGetNonBlocking
#else
#define MAP_SSIDataGetNonBlocking \
        SSIDataGetNonBlocking
#endif
#ifdef ROM_SSIDMAEnable
#define MAP_SSIDMAEnable \
        ROM_SSIDMAEnable
#else
#define MAP_SSIDMAEnable \
        SSIDMAEnable
#endif
#ifdef ROM_SSIDMADisable
#define MAP_SSIDMADisable \
        ROM_SSIDMADisable
#else
#define MAP_SSIDMADisable \
        SSIDMADisable
#endif
#ifdef ROM_SSIBusy
#define MAP_SSIBusy \
        ROM_SSIBusy
#else
#define MAP_SSIBusy \
        SSIBusy
#endif
#ifdef ROM_SSIClockSourceGet
#define MAP_SSIClockSourceGet \
        ROM_SSIClockSourceGet
#else
#define MAP_SSIClockSourceGet \
        SSIClockSourceGet
#endif
#ifdef ROM_SSIClockSourceSet
#define MAP_SSIClockSourceSet \
        ROM_SSIClockSourceSet
#else
#define MAP_SSIClockSourceSet \
        SSIClockSourceSet
#endif

